Revit 2027 API
UIFabricationUtils Class
 General Fabrication UI utility methods in Revit UI.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIFabricationUtils
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class UIFabricationUtils
Public NotInheritable Class UIFabricationUtils
public ref class UIFabricationUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UIFabricationUtils = class end
The UIFabricationUtils type exposes the following members.
Methods
Name | Description
GetOpenConnectorIndicatorAwayColor |  Gets the color of the open connector indicator in away direction.
GetOpenConnectorIndicatorPlanColor |  Gets the color of the open connector indicator in plan view.
GetOpenConnectorIndicatorTowardsColor |  Gets the color of the open connector indicator in towards direction.
SetOpenConnectorIndicatorAwayColor |  Sets the color of the open connector indicator in away direction
SetOpenConnectorIndicatorPlanColor |  Sets the color of the open connector indicator in plan view.
SetOpenConnectorIndicatorTowardsColor |  Sets the color of the open connector indicator in towards direction
Top
See Also
Reference
Autodesk.Revit.UI Namespace